<h1 style="font-weight:bold"> Extend Berkeley Packet Filter </h1>

 eBPF is used extensively to drive a wide variety of use cases: <br>
 * Providing high-performance networking and load-balancing in modern data centers and cloud native environments.
 * extracting fine-grained security observability data at low overhead.
 * [helping application developers trace applications](#code_tracing).
 * providing insights for performance troubleshooting.
 * preventive application and container runtime security enforcement.<br>
see [epbf.io](https://ebpf.io/) for more information.<br>

<h2 style="font-weight:bold"> Code Tracing </h2>

Before understand how ebpf work at kernel code tracing, that's a samples linux provide is necessary to take a look.<br>
Show packet information when receive packet from `lo` interface. <br>
```c
samples/bpf/tracex1_user.c
#include <stdio.h>
#include <unistd.h>
#include <bpf/libbpf.h>
#include "trace_helpers.h"

int main(int ac, char **argv)
{
        struct bpf_link *link = NULL;
        struct bpf_program *prog;
        struct bpf_object *obj;
        char filename[256];
        FILE *f;

        snprintf(filename, sizeof(filename), "%s_kern.o", argv[0]);
        obj = bpf_object__open_file(filename, NULL);
        if (libbpf_get_error(obj)) {
                fprintf(stderr, "ERROR: opening BPF object file failed\n");
                return 0;
        }

        prog = bpf_object__find_program_by_name(obj, "bpf_prog1");
        if (!prog) {

        __u32 str_off;
        __u32 str_len;
    }
    ```
    We can know the BTF information by dump the raw date of BTF header.<br>
    ```
    ➜  bpf git:(master) ✗ hexdump -s 114103 -n 24 tracex1_kern.o
    001bdb7 eb9f 0001 0018 0000 0000 0000 0204 0000
    001bdc7 0204 0000 0252 0000
    001bdcf
    ```
    * Magic : eb9f
    * Version : 0
    * Flags : 0x01
    * Header Len: 24
    * Type offset : 0
    * Type Len : 516
        ```
        ➜  bpf git:(master) ✗ hexdump -s 114127 -n 516 tracex1_kern.o
        001bdcf 0000 0000 0000 0200 0002 0000 0001 0000
        001bddf 0015 0400 00a8 0000 0009 0000 0003 0000
        001bdef 0000 0000 000d 0000 0003 0000 0040 0000
        001bdff 0011 0000 0003 0000 0080 0000 0015 0000
        001be0f 0003 0000 00c0 0000 0019 0000 0003 0000
        001be1f 0100 0000 001c 0000 0003 0000 0140 0000
        001be2f 001f 0000 0003 0000 0180 0000 0023 0000
        001be3f 0003 0000 01c0 0000 0027 0000 0003 0000
        001be4f 0200 0000 002a 0000 0003 0000 0240 0000
        001be5f 002d 0000 0003 0000 0280 0000 0030 0000
        001be6f 0003 0000 02c0 0000 0033 0000 0003 0000
        001be7f 0300 0000 0036 0000 0003 0000 0340 0000
        001be8f 0039 0000 0003 0000 0380 0000 003c 0000
        001be9f 0003 0000 03c0 0000 0044 0000 0003 0000
        001beaf 0400 0000 0047 0000 0003 0000 0440 0000
        001bebf 004a 0000 0003 0000 0480 0000 0050 0000
        001becf 0003 0000 04c0 0000 0053 0000 0003 0000
        001bedf 0500 0000 0056 0000 0000 0100 0008 0000
        001beef 0040 0000 0000 0000 0001 0d00 0005 0000
        001beff 0068 0000 0001 0000 006c 0000 0000 0100
        001bf0f 0004 0000 0020 0100 0070 0000 0001 0c00
        001bf1f 0004 0000 0200 0000 0000 0100 0001 0000
        001bf2f 0008 0100 0000 0000 0000 0300 0000 0000
        001bf3f 0007 0000 0009 0000 0004 0000 0205 0000
        001bf4f 0000 0100 0004 0000 0020 0000 0219 0000
        001bf5f 0000 0e00 0008 0000 0001 0000 0222 0000
        001bf6f 0000 0800 000c 0000 0226 0000 0000 0800
        001bf7f 000d 0000 022c 0000 0000 0100 0004 0000
        001bf8f 0020 0000 0239 0000 0000 0e00 000b 0000
        001bf9f 0001 0000 0242 0000 0001 0f00 0000 0000
        001bfaf 000a 0000 0000 0000 0004 0000 024a 0000
        001bfbf 0001 0f00 0000 0000 000e 0000 0000 0000
        001bfcf 0004 0000
        001bfd3
        ```
    * String offset : 516
    * String Len : 594
        ```
        ➜  bpf git:(master) ✗ hexdump -C -s 114643 -n 594 tracex1_kern.o
        0001bfd3  00 70 74 5f 72 65 67 73  00 72 31 35 00 72 31 34  |.pt_regs.r15.r14|
        0001bfe3  00 72 31 33 00 72 31 32  00 62 70 00 62 78 00 72  |.r13.r12.bp.bx.r|
        0001bff3  31 31 00 72 31 30 00 72  39 00 72 38 00 61 78 00  |11.r10.r9.r8.ax.|
        0001c003  63 78 00 64 78 00 73 69  00 64 69 00 6f 72 69 67  |cx.dx.si.di.orig|
        0001c013  5f 61 78 00 69 70 00 63  73 00 66 6c 61 67 73 00  |_ax.ip.cs.flags.|
        0001c023  73 70 00 73 73 00 6c 6f  6e 67 20 75 6e 73 69 67  |sp.ss.long unsig|
        0001c033  6e 65 64 20 69 6e 74 00  63 74 78 00 69 6e 74 00  |ned int.ctx.int.|
        0001c043  62 70 66 5f 70 72 6f 67  31 00 6b 70 72 6f 62 65  |bpf_prog1.kprobe|
        0001c053  2f 5f 5f 6e 65 74 69 66  5f 72 65 63 65 69 76 65  |/__netif_receive|
        0001c063  5f 73 6b 62 5f 63 6f 72  65 00 2f 72 6f 6f 74 2f  |_skb_core./root/|
        0001c073  73 6f 75 72 63 65 2f 6c  69 6e 75 78 2f 73 61 6d  |source/linux/sam|
        0001c083  70 6c 65 73 2f 62 70 66  2f 74 72 61 63 65 78 31  |ples/bpf/tracex1|
        0001c093  5f 6b 65 72 6e 2e 63 00  09 62 70 66 5f 70 72 6f  |_kern.c..bpf_pro|
        0001c0a3  62 65 5f 72 65 61 64 5f  6b 65 72 6e 65 6c 28 26  |be_read_kernel(&|
        0001c0b3  73 6b 62 2c 20 73 69 7a  65 6f 66 28 73 6b 62 29  |skb, sizeof(skb)|
        0001c0c3  2c 20 28 76 6f 69 64 20  2a 29 50 54 5f 52 45 47  |, (void *)PT_REG|
        0001c0d3  53 5f 50 41 52 4d 31 28  63 74 78 29 29 3b 00 09  |S_PARM1(ctx));..|
        0001c0e3  64 65 76 20 3d 20 5f 28  73 6b 62 2d 3e 64 65 76  |dev = _(skb->dev|
        0001c0f3  29 3b 00 09 6c 65 6e 20  3d 20 5f 28 73 6b 62 2d  |);..len = _(skb-|
        0001c103  3e 6c 65 6e 29 3b 00 09  62 70 66 5f 70 72 6f 62  |>len);..bpf_prob|
        0001c113  65 5f 72 65 61 64 5f 6b  65 72 6e 65 6c 28 64 65  |e_read_kernel(de|
        0001c123  76 6e 61 6d 65 2c 20 73  69 7a 65 6f 66 28 64 65  |vname, sizeof(de|
        0001c133  76 6e 61 6d 65 29 2c 20  64 65 76 2d 3e 6e 61 6d  |vname), dev->nam|
        0001c143  65 29 3b 00 09 69 66 20  28 64 65 76 6e 61 6d 65  |e);..if (devname|
        0001c153  5b 30 5d 20 3d 3d 20 27  6c 27 20 26 26 20 64 65  |[0] == 'l' && de|
        0001c163  76 6e 61 6d 65 5b 31 5d  20 3d 3d 20 27 6f 27 29  |vname[1] == 'o')|
        0001c173  20 7b 00 09 09 63 68 61  72 20 66 6d 74 5b 5d 20  | {...char fmt[] |
        0001c183  3d 20 22 73 6b 62 20 25  70 20 6c 65 6e 20 25 64  |= "skb %p len %d|
        0001c193  5c 6e 22 3b 00 09 09 62  70 66 5f 74 72 61 63 65  |\n";...bpf_trace|
        0001c1a3  5f 70 72 69 6e 74 6b 28  66 6d 74 2c 20 73 69 7a  |_printk(fmt, siz|
        0001c1b3  65 6f 66 28 66 6d 74 29  2c 20 73 6b 62 2c 20 6c  |eof(fmt), skb, l|
        0001c1c3  65 6e 29 3b 00 09 72 65  74 75 72 6e 20 30 3b 00  |en);..return 0;.|
        0001c1d3  63 68 61 72 00 5f 5f 41  52 52 41 59 5f 53 49 5a  |char.__ARRAY_SIZ|
        0001c1e3  45 5f 54 59 50 45 5f 5f  00 5f 6c 69 63 65 6e 73  |E_TYPE__._licens|
        0001c1f3  65 00 75 33 32 00 5f 5f  75 33 32 00 75 6e 73 69  |e.u32.__u32.unsi|
        0001c203  67 6e 65 64 20 69 6e 74  00 5f 76 65 72 73 69 6f  |gned int._versio|
        0001c213  6e 00 6c 69 63 65 6e 73  65 00 76 65 72 73 69 6f  |n.license.versio|
        *
        0001c225
        ```
    Or print human readable information of BTF section directly by `bpftool`.<br>
    ```
    ➜  bpftool git:(master) ✗ ./bpftool btf dump file ../tracex1_kern.o
    [1] PTR '(anon)' type_id=2
    [2] STRUCT 'pt_regs' size=168 vlen=21
            'r15' type_id=3 bits_offset=0
            'r14' type_id=3 bits_offset=64
            'r13' type_id=3 bits_offset=128
            'r12' type_id=3 bits_offset=192
            'bp' type_id=3 bits_offset=256
            'bx' type_id=3 bits_offset=320
            'r11' type_id=3 bits_offset=384
            'r10' type_id=3 bits_offset=448
            'r9' type_id=3 bits_offset=512
            'r8' type_id=3 bits_offset=576
            'ax' type_id=3 bits_offset=640
            'cx' type_id=3 bits_offset=704
            'dx' type_id=3 bits_offset=768
            'si' type_id=3 bits_offset=832
            'di' type_id=3 bits_offset=896
            'orig_ax' type_id=3 bits_offset=960
            'ip' type_id=3 bits_offset=1024
            'cs' type_id=3 bits_offset=1088
            'flags' type_id=3 bits_offset=1152
            'sp' type_id=3 bits_offset=1216
            'ss' type_id=3 bits_offset=1280
    [3] INT 'long unsigned int' size=8 bits_offset=0 nr_bits=64 encoding=(none)
    [4] FUNC_PROTO '(anon)' ret_type_id=5 vlen=1
            'ctx' type_id=1
    [5] INT 'int' size=4 bits_offset=0 nr_bits=32 encoding=SIGNED
    [6] FUNC 'bpf_prog1' type_id=4 linkage=global
    [7] INT 'char' size=1 bits_offset=0 nr_bits=8 encoding=SIGNED
    [8] ARRAY '(anon)' type_id=7 index_type_id=9 nr_elems=4
    [9] INT '__ARRAY_SIZE_TYPE__' size=4 bits_offset=0 nr_bits=32 encoding=(none)
    [10] VAR '_license' type_id=8, linkage=global
    [11] TYPEDEF 'u32' type_id=12
    [12] TYPEDEF '__u32' type_id=13
    [13] INT 'unsigned int' size=4 bits_offset=0 nr_bits=32 encoding=(none)
    [14] VAR '_version' type_id=11, linkage=global
    [15] DATASEC 'license' size=0 vlen=1
            type_id=10 offset=0 size=4 (VAR '_license')
    [16] DATASEC 'version' size=0 vlen=1
            type_id=14 offset=0 size=4 (VAR '_version')
    ```
    print human readable information of BTF section directly by `llvm-objdump`.
    ```
    ➜  bpf git:(master) ✗ llvm-objdump-6.0 -d  tracex1_kern.o

        tracex1_kern.o: file format elf64-bpf

        Disassembly of section kprobe/__netif_receive_skb_core:

        0000000000000000 <bpf_prog1>:
        0:       79 13 70 00 00 00 00 00 r3 = *(u64 *)(r1 + 112)
        1:       bf a1 00 00 00 00 00 00 r1 = r10
        2:       07 01 00 00 e8 ff ff ff r1 += -24
        3:       b7 02 00 00 08 00 00 00 r2 = 8
        4:       85 00 00 00 71 00 00 00 call 113
        5:       b7 06 00 00 00 00 00 00 r6 = 0
        6:       7b 6a f0 ff 00 00 00 00 *(u64 *)(r10 - 16) = r6
        7:       79 a3 e8 ff 00 00 00 00 r3 = *(u64 *)(r10 - 24)
        8:       07 03 00 00 10 00 00 00 r3 += 16
        9:       bf a1 00 00 00 00 00 00 r1 = r10
        10:       07 01 00 00 f0 ff ff ff r1 += -16
        11:       b7 02 00 00 08 00 00 00 r2 = 8
        12:       85 00 00 00 71 00 00 00 call 113
        13:       79 a7 f0 ff 00 00 00 00 r7 = *(u64 *)(r10 - 16)
        14:       63 6a f0 ff 00 00 00 00 *(u32 *)(r10 - 16) = r6
        15:       79 a3 e8 ff 00 00 00 00 r3 = *(u64 *)(r10 - 24)
        16:       07 03 00 00 70 00 00 00 r3 += 112
        17:       bf a1 00 00 00 00 00 00 r1 = r10
        18:       07 01 00 00 f0 ff ff ff r1 += -16
        19:       b7 02 00 00 04 00 00 00 r2 = 4
        20:       85 00 00 00 71 00 00 00 call 113
        21:       61 a6 f0 ff 00 00 00 00 r6 = *(u32 *)(r10 - 16)
        22:       bf a1 00 00 00 00 00 00 r1 = r10
        23:       07 01 00 00 f0 ff ff ff r1 += -16
        24:       b7 02 00 00 10 00 00 00 r2 = 16
        25:       bf 73 00 00 00 00 00 00 r3 = r7
        26:       85 00 00 00 71 00 00 00 call 113
        27:       71 a1 f0 ff 00 00 00 00 r1 = *(u8 *)(r10 - 16)
        28:       55 01 11 00 6c 00 00 00 if r1 != 108 goto +17 <LBB0_3>
        29:       71 a1 f1 ff 00 00 00 00 r1 = *(u8 *)(r10 - 15)
        30:       55 01 0f 00 6f 00 00 00 if r1 != 111 goto +15 <LBB0_3>
        31:       b7 01 00 00 00 00 00 00 r1 = 0
        32:       73 1a e6 ff 00 00 00 00 *(u8 *)(r10 - 26) = r1
        33:       b7 01 00 00 64 0a 00 00 r1 = 2660
        34:       6b 1a e4 ff 00 00 00 00 *(u16 *)(r10 - 28) = r1
        35:       b7 01 00 00 65 6e 20 25 r1 = 622882405
        36:       63 1a e0 ff 00 00 00 00 *(u32 *)(r10 - 32) = r1
        37:       18 01 00 00 73 6b 62 20 00 00 00 00 25 70 20 6c r1 = 7791350660110379891 ll
        39:       7b 1a d8 ff 00 00 00 00 *(u64 *)(r10 - 40) = r1
        40:       79 a3 e8 ff 00 00 00 00 r3 = *(u64 *)(r10 - 24)
        41:       bf a1 00 00 00 00 00 00 r1 = r10
        42:       07 01 00 00 d8 ff ff ff r1 += -40
        43:       b7 02 00 00 0f 00 00 00 r2 = 15
        44:       bf 64 00 00 00 00 00 00 r4 = r6
        45:       85 00 00 00 06 00 00 00 call 6

        0000000000000170 <LBB0_3>:
        46:       b7 00 00 00 00 00 00 00 r0 = 0
        47:       95 00 00 00 00 00 00 00 exit
    ```
    * SHT_REL<br>
        <font color="red">TODO</font>

<h3 style="font-weight:bold" id="load_bpf_prog_to_kernel"> Load BPF program to Kernel. </h3>

#### User Space
`bpf_object__load()` -> `bpf_object_load()` -> `bpf_object__load_progs()` -> `bpf_object_load_prog()`
```c
static int bpf_object_load_prog(struct bpf_object *obj, struct bpf_program *prog, const char *license, __u32 kern_ver) {
                ...
        for (i = 0; i < prog->instances.nr; i++) {
                struct bpf_prog_prep_result result;
                bpf_program_prep_t preprocessor = prog->preprocessor;

                preprocessor(prog, i, prog->insns, prog->insns_cnt, &result);

